summary-service/benchmark/load-test_20260131_211733.txt
=== Summary Service Load Test Results ===
Date: Sat Jan 31 21:17:33 CST 2026
Test: load_test.sh
Service: http://localhost:8082
Requests: 1000
Concurrency: 10

========================================
Test 1: GET /summary/daily
========================================


Summary:
  Total:	0.3652 secs
  Slowest:	0.0790 secs
  Fastest:	0.0002 secs
  Average:	0.0035 secs
  Requests/sec:	2738.1088
  

Response time histogram:
  0.000 [1]	|
  0.008 [915]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.016 [46]	|■■
  0.024 [18]	|■
  0.032 [9]	|
  0.040 [0]	|
  0.048 [1]	|
  0.055 [5]	|
  0.063 [0]	|
  0.071 [3]	|
  0.079 [2]	|


Latency distribution:
  10% in 0.0008 secs
  25% in 0.0012 secs
  50% in 0.0017 secs
  75% in 0.0026 secs
  90% in 0.0048 secs
  95% in 0.0143 secs
  99% in 0.0521 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0002 secs, 0.0790 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0021 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0143 secs
  resp wait:	0.0034 secs, 0.0002 secs, 0.0790 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0005 secs

Status code distribution:
  [204]	1000 responses



========================================
Test 2: GET /summary/weekly
========================================


Summary:
  Total:	0.3501 secs
  Slowest:	0.0480 secs
  Fastest:	0.0003 secs
  Average:	0.0032 secs
  Requests/sec:	2856.1554
  

Response time histogram:
  0.000 [1]	|
  0.005 [900]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.010 [14]	|■
  0.015 [43]	|■■
  0.019 [27]	|■
  0.024 [9]	|
  0.029 [1]	|
  0.034 [3]	|
  0.038 [1]	|
  0.043 [0]	|
  0.048 [1]	|


Latency distribution:
  10% in 0.0010 secs
  25% in 0.0013 secs
  50% in 0.0018 secs
  75% in 0.0029 secs
  90% in 0.0050 secs
  95% in 0.0139 secs
  99% in 0.0220 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0003 secs, 0.0480 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0010 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0032 secs, 0.0003 secs, 0.0480 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0073 secs

Status code distribution:
  [204]	1000 responses



========================================
Test 3: GET /health (Baseline)
========================================


Summary:
  Total:	0.0216 secs
  Slowest:	0.0036 secs
  Fastest:	0.0001 secs
  Average:	0.0002 secs
  Requests/sec:	46273.4445
  
  Total data:	95890 bytes
  Size/request:	95 bytes

Response time histogram:
  0.000 [1]	|
  0.000 [955]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [33]	|■
  0.001 [1]	|
  0.001 [0]	|
  0.002 [0]	|
  0.002 [0]	|
  0.003 [0]	|
  0.003 [0]	|
  0.003 [4]	|
  0.004 [6]	|


Latency distribution:
  10% in 0.0001 secs
  25% in 0.0001 secs
  50% in 0.0002 secs
  75% in 0.0002 secs
  90% in 0.0003 secs
  95% in 0.0004 secs
  99% in 0.0031 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0001 secs, 0.0036 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0016 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0004 secs
  resp wait:	0.0002 secs, 0.0000 secs, 0.0012 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0005 secs

Status code distribution:
  [200]	1000 responses



========================================
Test completed at: Sat Jan 31 21:17:34 CST 2026
Results saved to: benchmark/load-test_20260131_211733.txt
========================================